trainingExperts/3_trainingFSexpert/inputs/baseline/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.064";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
294.43984
294.43753
294.4339
294.42876
294.42178
294.41265
294.40098
294.38633
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            fixedValue;
        value           uniform 294.44;
    }
    inflow2
    {
        type            fixedValue;
        value           uniform 294.44;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 294.44;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 294.44;
        value           nonuniform List<scalar> 
112
(
294.3252
294.32519
294.32518
294.32516
294.32514
294.32511
294.32507
294.32503
...
)
;
    }
    wall1
    {
        type            zeroGradient;
    }
    wall2
    {
        type            zeroGradient;
    }
    wall3
    {
        type            zeroGradient;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
