trainingExperts/3_trainingFSexpert/inputs/baseline/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.064";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
5.0069487e-05
1.7651084e-05
1.1452637e-05
8.4685444e-06
6.6362676e-06
5.4076985e-06
4.5409122e-06
3.90302e-06
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
3.3321578e-08
5.5594507e-08
8.5790646e-08
1.2770104e-07
1.8774657e-07
2.7733998e-07
4.1775348e-07
6.5109232e-07
...
)
;
    }
    inflow2
    {
        type            calculated;
        value           nonuniform List<scalar> 
158
(
0.00071020642
0.0013367736
0.0013471305
0.0013309646
0.0013470202
0.0013935438
0.0014541867
0.0015123947
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
0.00012597666
9.7963016e-05
9.0375765e-05
7.6556131e-05
6.5711257e-05
5.4318482e-05
4.419602e-05
3.5780595e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
112
(
0.27871061
0.27870286
0.2786948
0.27871053
0.27873145
0.27875854
0.27879292
0.27883523
...
)
;
    }
    wall1
    {
        type            compressible::alphatWallFunction;
        value           nonuniform List<scalar> 
48
(
8.7679385e-10
2.588222e-10
1.4207287e-10
7.8658137e-11
7.162483e-11
1.1065952e-10
1.5463331e-10
1.9962144e-10
...
)
;
    }
    wall2
    {
        type            compressible::alphatWallFunction;
        value           nonuniform List<scalar> 
30
(
9.9505511e-09
2.4787863e-09
1.3872528e-09
1.0848632e-09
9.3446959e-10
8.5241387e-10
8.1279415e-10
8.0918282e-10
...
)
;
    }
    wall3
    {
        type            compressible::alphatWallFunction;
        value           nonuniform List<scalar> 
16
(
0.00015981906
0.00012965364
8.0049969e-05
3.4067713e-05
1.1175082e-05
7.1718562e-06
7.7465912e-06
9.0956643e-06
1.1212193e-05
1.3471057e-05
1.5649755e-05
1.7571087e-05
1.9092188e-05
2.0237503e-05
2.1219974e-05
2.209408e-05
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
