trainingExperts/3_trainingFSexpert/inputs/baseline/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.064";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
3.5042931e-05
1.2353789e-05
8.0157013e-06
5.9272928e-06
4.6450255e-06
3.7852928e-06
3.1787789e-06
2.7324797e-06
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
2.7858433e-08
4.6479669e-08
7.1725088e-08
1.0676419e-07
1.5696514e-07
2.3186954e-07
3.4926199e-07
5.4434453e-07
...
)
;
    }
    inflow2
    {
        type            calculated;
        value           nonuniform List<scalar> 
158
(
0.00059375323
0.0011175816
0.0011262403
0.0011127251
0.001126148
0.0011650431
0.0012157423
0.0012644058
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
8.8169869e-05
6.8563381e-05
6.3253128e-05
5.3580888e-05
4.5990649e-05
3.8016938e-05
3.0932302e-05
2.5042401e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
112
(
0.23293907
0.23293279
0.23292602
0.23293913
0.23295658
0.23297918
0.23300788
0.23304319
...
)
;
    }
    wall1
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
48
(
5.2137336e-10
1.5391654e-10
8.4490533e-11
4.6776844e-11
4.259098e-11
6.5801945e-11
9.1953009e-11
1.1871219e-10
...
)
;
    }
    wall2
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
30
(
7.0713372e-09
1.761553e-09
9.8585154e-10
7.7095808e-10
6.6408086e-10
6.0576798e-10
5.7761235e-10
5.7504634e-10
...
)
;
    }
    wall3
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
16
(
0.00011197136
9.1360935e-05
5.6529366e-05
2.4124608e-05
7.9335135e-06
5.0968506e-06
5.5069852e-06
6.4664515e-06
7.9709064e-06
9.5761655e-06
1.1124421e-05
1.2489817e-05
1.3570867e-05
1.438498e-05
1.5083455e-05
1.5704861e-05
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
