trainingExperts/3_trainingFSexpert/inputs/baseline/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.064";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
1.4288042
1.4287992
1.4287755
1.4287373
1.4286827
1.4286077
1.4285084
1.4283803
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
1.1961038
1.1961038
1.1961037
1.1961037
1.1961036
1.1961035
1.1961035
1.1961034
...
)
;
    }
    inflow2
    {
        type            calculated;
        value           nonuniform List<scalar> 
158
(
1.1961306
1.1961306
1.1961307
1.1961307
1.1961307
1.1961307
1.1961307
1.1961308
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
1.4287949
1.428795
1.4287952
1.4287955
1.428796
1.4287969
1.4287983
1.4288005
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
112
(
1.1964958
1.1964948
1.1964949
1.1964951
1.1964953
1.1964955
1.1964957
1.1964959
...
)
;
    }
    wall1
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
1.4294455
1.4293387
1.4292955
1.4293272
1.4294366
1.4294501
1.4294074
1.4293244
...
)
;
    }
    wall2
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
1.1960918
1.1960857
1.1960877
1.196088
1.196088
1.196088
1.1960877
1.1960869
...
)
;
    }
    wall3
    {
        type            calculated;
        value           nonuniform List<scalar> 
16
(
1.2132227
1.206266
1.203666
1.2003327
1.197303
1.1960479
1.1956819
1.1956039
1.1956437
1.1957185
1.1957739
1.1958081
1.1958234
1.1958221
1.1958121
1.1958061
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
